app/views/websites/_form.html.haml

SELECT "products".* FROM "products"
---
        = f.label :product
        = f.collection_select :product_id, Product.all, :id, :name

SELECT "versions".* FROM "versions"
---
        = f.label :version
        = f.collection_select :version_id, Version.all, :id, :name